; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v3 - type_2)
 	      (pred_4 ?v7 - object ?v3 - type_2)
	      (pred_1 ?v1 - type_1 ?v2 - type_3)
	      (pred_2 ?v1 - type_1 ?v7 - object ?v2 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v4 ?v6 - type_2)
       :precondition (and  (pred_3 ?v1 ?v4))
       :effect (and  (pred_3 ?v1 ?v6)
		     (not (pred_3 ?v1 ?v4))))

   (:action op_1
       :parameters (?v1 - type_1 ?v8 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v5) (pred_3 ?v1 ?v5) (pred_1 ?v1 ?v2))
       :effect (and (pred_2 ?v1 ?v8 ?v2)
		    (not (pred_4 ?v8 ?v5)) 
		    (not (pred_1 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_1 ?v8 - object ?v5 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v8 ?v2) (pred_3 ?v1 ?v5))
       :effect (and (pred_4 ?v8 ?v5)
		    (pred_1 ?v1 ?v2)
		    (not (pred_2 ?v1 ?v8 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_01 obj_08 - type_1
obj_11 obj_13 obj_03 obj_05 - type_3
obj_02 obj_06 obj_07 obj_10 - type_2
obj_12 obj_04 obj_09 - object)
(:init
(pred_3 obj_01 obj_02)
(pred_1 obj_01 obj_11)
(pred_1 obj_01 obj_13)
(pred_3 obj_08 obj_06)
(pred_1 obj_08 obj_03)
(pred_1 obj_08 obj_05)
(pred_4 obj_12 obj_07)
(pred_4 obj_04 obj_06)
(pred_4 obj_09 obj_07)
)
(:goal
(and
(pred_4 obj_12 obj_06)
(pred_4 obj_04 obj_02)
(pred_4 obj_09 obj_02)
)
)

(:constraints
  (always (not (pred_3 obj_01 obj_07)))
)
)

; plan
1. (op_3 obj_01 obj_02 obj_06)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_06)
   goals met: 0 of 3
2. (op_1 obj_08 obj_04 obj_06 obj_05)
   deleted: (pred_4 obj_04 obj_06) (pred_1 obj_08 obj_05)
   added: (pred_2 obj_08 obj_04 obj_05)
   goals met: 0 of 3
3. (op_3 obj_08 obj_06 obj_07)
   deleted: (pred_3 obj_08 obj_06)
   added: (pred_3 obj_08 obj_07)
   goals met: 0 of 3
4. (op_1 obj_08 obj_09 obj_07 obj_03)
   deleted: (pred_4 obj_09 obj_07) (pred_1 obj_08 obj_03)
   added: (pred_2 obj_08 obj_09 obj_03)
   goals met: 0 of 3
5. (op_3 obj_08 obj_07 obj_02)
   deleted: (pred_3 obj_08 obj_07)
   added: (pred_3 obj_08 obj_02)
   goals met: 0 of 3
6. (op_2 obj_08 obj_09 obj_02 obj_03)
   deleted: (pred_2 obj_08 obj_09 obj_03)
   added: (pred_4 obj_09 obj_02) (pred_1 obj_08 obj_03)
   goals met: 1 of 3
7. (op_2 obj_08 obj_04 obj_02 obj_05)
   deleted: (pred_2 obj_08 obj_04 obj_05)
   added: (pred_4 obj_04 obj_02) (pred_1 obj_08 obj_05)
   goals met: 2 of 3
8. (op_3 obj_08 obj_02 obj_07)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_07)
   goals met: 2 of 3
9. (op_1 obj_08 obj_12 obj_07 obj_05)
   deleted: (pred_4 obj_12 obj_07) (pred_1 obj_08 obj_05)
   added: (pred_2 obj_08 obj_12 obj_05)
   goals met: 2 of 3
10. (op_3 obj_08 obj_07 obj_06)
   deleted: (pred_3 obj_08 obj_07)
   added: (pred_3 obj_08 obj_06)
   goals met: 2 of 3
11. (op_2 obj_08 obj_12 obj_06 obj_05)
   deleted: (pred_2 obj_08 obj_12 obj_05)
   added: (pred_4 obj_12 obj_06) (pred_1 obj_08 obj_05)
   goals met: 3 of 3
